[
  {
    "id": 1,
    "name": "Aryaan Bhamgara",
    "location": "Winnipeg, MB",
    "subjects": ["English", "Math", "IT"],
    "rate": 25,
    "rating": 4.9,
    "reviewsCount": 23,
    "description": "Experienced tutor with a focus on personalized learning and test prep.",
    "longDescription": "Aryaan is a seasoned educator with over five years of tutoring experience. Specialising in English, math and information technology, he crafts personalised lesson plans to ensure every student reaches their goals. When he's not teaching you'll find him exploring the latest tech trends or reading a good novel.",
    "image": "https://via.placeholder.com/500"
  },
  {
    "id": 2,
    "name": "Farhan Abrar",
    "location": "Winnipeg, MB",
    "subjects": ["Science", "Biology", "Guitar"],
    "rate": 30,
    "rating": 4.8,
    "reviewsCount": 17,
    "description": "Genetics graduate helping students excel in life sciences.",
    "longDescription": "Farhan holds a degree in Genetics and enjoys sharing his passion for the life sciences. His lessons blend academic rigour with real‑world applications to keep students engaged. Outside of tutoring he plays guitar in a local band and offers beginner guitar lessons.",
    "image": "https://via.placeholder.com/500"
  },
  {
    "id": 3,
    "name": "Zaheeb Khan",
    "location": "Winnipeg, MB",
    "subjects": ["Economics", "Math", "Physics"],
    "rate": 28,
    "rating": 5.0,
    "reviewsCount": 32,
    "description": "Economics tutor with real‑world experience and clear explanations.",
    "longDescription": "Zaheeb brings industry experience from the finance sector into his lessons. He believes understanding the 'why' behind formulas is just as important as the 'how'. His approachable style helps students build confidence in economics, maths and physics.",
    "image": "https://via.placeholder.com/500"
  },
  {
    "id": 4,
    "name": "Sarahi Cruz",
    "location": "Puerto Rico",
    "subjects": ["Spanish", "English"],
    "rate": 22,
    "rating": 4.7,
    "reviewsCount": 12,
    "description": "Bilingual educator with a passion for language learning.",
    "longDescription": "Sarahi is a certified language teacher fluent in Spanish and English. She creates engaging, interactive sessions for beginners through advanced students. Her passion for travel and culture informs her lessons and helps students connect language learning to real life.",
    "image": "https://via.placeholder.com/500"
  }
]
